Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 6, 7, 2)]    0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 6, 7, 64)     1216        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 6, 7, 64)     256         conv2d[0][0]                     
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 6, 7, 64)     0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 6, 7, 64)     36928       leaky_re_lu[0][0]                
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 6, 7, 64)     256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 6, 7, 64)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 6, 7, 64)     36928       leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 6, 7, 64)     256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
add (Add)                       (None, 6, 7, 64)     0           batch_normalization_2[0][0]      
                                                                 leaky_re_lu[0][0]                
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 6, 7, 64)     0           add[0][0]                        
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 6, 7, 64)     36928       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 6, 7, 64)     256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 6, 7, 64)     0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 6, 7, 64)     36928       leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 6, 7, 64)     256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 6, 7, 64)     0           batch_normalization_4[0][0]      
                                                                 leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 6, 7, 64)     0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 6, 7, 64)     36928       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 6, 7, 64)     256         conv2d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 6, 7, 64)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 6, 7, 64)     36928       leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 6, 7, 64)     256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 6, 7, 64)     0           batch_normalization_6[0][0]      
                                                                 leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 6, 7, 64)     0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 6, 7, 64)     36928       leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 6, 7, 64)     256         conv2d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 6, 7, 64)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 6, 7, 64)     36928       leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 6, 7, 64)     256         conv2d_8[0][0]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 6, 7, 64)     0           batch_normalization_8[0][0]      
                                                                 leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 6, 7, 64)     0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 6, 7, 64)     36928       leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 6, 7, 64)     256         conv2d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 6, 7, 64)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 6, 7, 64)     36928       leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 6, 7, 64)     256         conv2d_10[0][0]                  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 6, 7, 64)     0           batch_normalization_10[0][0]     
                                                                 leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 6, 7, 64)     0           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 6, 7, 64)     36928       leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 6, 7, 64)     256         conv2d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 6, 7, 64)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 6, 7, 64)     36928       leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 6, 7, 64)     256         conv2d_12[0][0]                  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 6, 7, 64)     0           batch_normalization_12[0][0]     
                                                                 leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 6, 7, 64)     0           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 6, 7, 64)     36928       leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 6, 7, 64)     256         conv2d_13[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 6, 7, 64)     0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 6, 7, 64)     36928       leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 6, 7, 64)     256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 6, 7, 64)     0           batch_normalization_14[0][0]     
                                                                 leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 6, 7, 64)     0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 6, 7, 1)      65          leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 6, 7, 1)      4           conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 6, 7, 2)      130         leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 6, 7, 1)      0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 6, 7, 2)      8           conv2d_15[0][0]                  
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 42)           0           leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 6, 7, 2)      0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
dense (Dense)                   (None, 64)           2752        flatten_1[0][0]                  
__________________________________________________________________________________________________
flatten (Flatten)               (None, 84)           0           leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 64)           0           dense[0][0]                      
__________________________________________________________________________________________________
policy (Dense)                  (None, 42)           3570        flatten[0][0]                    
__________________________________________________________________________________________________
value (Dense)                   (None, 1)            65          leaky_re_lu_17[0][0]             
==================================================================================================
Total params: 528,642
Trainable params: 526,716
Non-trainable params: 1,926
__________________________________________________________________________________________________
